Управление_торговлей_демо_115.РабочийСтол1С/src/InformationRegisters/РБ_НастройкиРабочегоСтола/РБ_НастройкиРабочегоСтола.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РБ_НастройкиРабочегоСтола</name>
  <resources>
    <name>Настройка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_торговлей_демо_115.РабочийСтол1С/src/InformationRegisters/РБ_НастройкиРабочегоСтола/ManagerModule.bsl
// Записать настройки рабочего стола.
// 
// Параметры:
//  Пользователи - Массив Из СправочникСсылка.Пользователи,СправочникСсылка.Пользователи - Массив пользователей
//  Настройка - ХранилищеЗначения - Настройка
Процедура ЗаписатьНастройкиРабочегоСтола(Пользователи, Настройка) Экспорт
	НаборДанных = РегистрыСведений.РБ_НастройкиРабочегоСтола.СоздатьНаборЗаписей();
	НаборДанных.Отбор.Пользователь.Установить(Пользователи);
	НаборДанных.Прочитать();
	НаборДанных.Очистить();
	
	Если ТипЗнч(Пользователи) <> Тип("Массив") Тогда
		МассивПользователей = Новый Массив;
		МассивПользователей.Добавить(Пользователи);
	Иначе
		МассивПользователей = Пользователи;
	КонецЕсли;
	
	Для Каждого Пользователь Из МассивПользователей Цикл
		ЗаписьНабора = НаборДанных.Добавить();
		ЗаписьНабора.Пользователь = Пользователь;
		ЗаписьНабора.Настройка = Настройка;
	КонецЦикла;
	НаборДанных.Записать();
КонецПроцедуры

// Получить настройку рабочего стола.
// 
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - Пользователь
// 
// Возвращаемое значение:
//  ХранилищеЗначения - Получить настройку рабочего стола
Функция ПолучитьНастройкуРабочегоСтола(Пользователь) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
						  |	РБ_НастройкиРабочегоСтола.Настройка
						  |ИЗ
						  |	РегистрСведений.РБ_НастройкиРабочегоСтола КАК РБ_НастройкиРабочегоСтола
						  |ГДЕ
						  |	РБ_НастройкиРабочегоСтола.Пользователь = &Пользователь");
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Настройка;
	КонецЕсли;
	Возврат Новый ХранилищеЗначения(Неопределено);
КонецФункции
